kafka_benchmark_results_20251002_003914/compression/producer-test.log
4990 records sent, 997.8 records/sec (0.97 MB/sec), 24.1 ms avg latency, 540.0 ms max latency.
5010 records sent, 1000.4 records/sec (0.98 MB/sec), 7.3 ms avg latency, 15.0 ms max latency.
12000 records sent, 999.167361 records/sec (0.98 MB/sec), 14.29 ms avg latency, 540.00 ms max latency, 8 ms 50th, 14 ms 95th, 177 ms 99th, 187 ms 99.9th.